lvx/base/InformationRegisters/бит_НастройкиБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиБюджетирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеФормироватьДвиженияПоФактуАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СценарийОтраженияФактаБДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьЗависимыеОборотыПриАвтоматическомСбореФакта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеФормироватьПроводкиБюджетированияПриАвтоматическомСбореФакта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьФактБДДСНаОснованииОперУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиБюджетированияУстановлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыСтруктурныхПодразделений</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_НастройкиБюджетирования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Процедура устанавливает значения регистра по умолчанию
//
// Параметры:
//   Запись           - РегистрСведенийЗапись - запись регистра
//   ДанныеЗаполнения - Структура - где ключ - имя ресурса
//
Процедура УстановкаНастроекПоУмолчанию(Запись, ДанныеЗаполнения) Экспорт
	
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"Период",
		ТекущаяДатаСеанса());
	
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"СтруктурноеПодразделение",
		Неопределено);
	
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"СценарийОтраженияФактаБДДС",
		Справочники.СценарииПланирования.ФАКТ);
		
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"НеФормироватьДвиженияПоФактуАвтоматически",
		Ложь);
	
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"НеФормироватьПроводкиБюджетированияПриАвтоматическомСбореФакта",
		Истина);
		
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ОтражатьФактБДДСНаОснованииОперУчета",
		Ложь);

	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"ФормироватьЗависимыеОборотыПриАвтоматическомСбореФакта",
		Ложь);
		
	бит_НастройкиПрограммы.УстановитьЗначениеПоУмолчанию(
		Запись,
		ДанныеЗаполнения,
		"НеУчитыватьСверхБюджетныеОперацииПриКонтролеПоБюджету",
		Ложь);
			
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
